import csv

"""
Прочитайте созданный в прошлом задании csv файл без использхования csv.DictReader.
Дополниет id до 10 цифр незначищами нулями.
В именах первую букву сделайте прописной.
Добавьте поле hash на основе имни и идентификатора.
Получившиеся записи сохраните в json файл, где каждая строка csv файла представлена как отдельный словарь.
Имя исходного и конеченого файлов передавайте как аргументы функции.
"""

 # def csv_to_json():
 #     with open("new.txt", "r", encoding="UTF-8") as f:
 #        csv_unique = csv.reader(f, dialect="excel")
 #        pass
